MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E2094CNH/mcu.h
/* =======================================================  ITLCMP00  ======================================================== */
/* =======================================================  ITLCMP01  ======================================================== */
/* ======================================================  ITLCMP00_L  ======================================================= */
/* ======================================================  ITLCMP01_L  ======================================================= */
/* ======================================================  ITLCMP00_H  ======================================================= */
/* ======================================================  ITLCMP01_H  ======================================================= */
/* =======================================================  ITLCAP00  ======================================================== */
/* ========================================================  ITLCTL0  ======================================================== */
 #define R_TML_ITLCTL0_EN0_Pos        (0UL)    /*!< EN0 (Bit 0)                                           */
 #define R_TML_ITLCTL0_EN0_Msk        (0x1UL)  /*!< EN0 (Bitfield-Mask: 0x01)                             */
 #define R_TML_ITLCTL0_EN1_Pos        (1UL)    /*!< EN1 (Bit 1)                                           */
 #define R_TML_ITLCTL0_EN1_Msk        (0x2UL)  /*!< EN1 (Bitfield-Mask: 0x01)                             */
 #define R_TML_ITLCTL0_EN2_Pos        (2UL)    /*!< EN2 (Bit 2)                                           */
 #define R_TML_ITLCTL0_EN2_Msk        (0x4UL)  /*!< EN2 (Bitfield-Mask: 0x01)                             */
 #define R_TML_ITLCTL0_EN3_Pos        (3UL)    /*!< EN3 (Bit 3)                                           */
 #define R_TML_ITLCTL0_EN3_Msk        (0x8UL)  /*!< EN3 (Bitfield-Mask: 0x01)                             */
 #define R_TML_ITLCTL0_MD_Pos         (6UL)    /*!< MD (Bit 6)                                            */
 #define R_TML_ITLCTL0_MD_Msk         (0xc0UL) /*!< MD (Bitfield-Mask: 0x03)                              */
/* =======================================================  ITLCSEL0  ======================================================== */
 #define R_TML_ITLCSEL0_ISEL_Pos      (0UL)    /*!< ISEL (Bit 0)                                          */
 #define R_TML_ITLCSEL0_ISEL_Msk      (0x7UL)  /*!< ISEL (Bitfield-Mask: 0x07)                            */
 #define R_TML_ITLCSEL0_CSEL_Pos      (4UL)    /*!< CSEL (Bit 4)                                          */
 #define R_TML_ITLCSEL0_CSEL_Msk      (0x70UL) /*!< CSEL (Bitfield-Mask: 0x07)                            */
/* =======================================================  ITLFDIV00  ======================================================= */
 #define R_TML_ITLFDIV00_FDIV0_Pos    (0UL)    /*!< FDIV0 (Bit 0)                                         */
 #define R_TML_ITLFDIV00_FDIV0_Msk    (0x7UL)  /*!< FDIV0 (Bitfield-Mask: 0x07)                           */
 #define R_TML_ITLFDIV00_FDIV1_Pos    (4UL)    /*!< FDIV1 (Bit 4)                                         */
 #define R_TML_ITLFDIV00_FDIV1_Msk    (0x70UL) /*!< FDIV1 (Bitfield-Mask: 0x07)                           */
/* =======================================================  ITLFDIV01  ======================================================= */
 #define R_TML_ITLFDIV01_FDIV2_Pos    (0UL)    /*!< FDIV2 (Bit 0)                                         */
 #define R_TML_ITLFDIV01_FDIV2_Msk    (0x7UL)  /*!< FDIV2 (Bitfield-Mask: 0x07)                           */
 #define R_TML_ITLFDIV01_FDIV3_Pos    (4UL)    /*!< FDIV3 (Bit 4)                                         */
 #define R_TML_ITLFDIV01_FDIV3_Msk    (0x70UL) /*!< FDIV3 (Bitfield-Mask: 0x07)                           */
/* ========================================================  ITLCC0  ========================================================= */
 #define R_TML_ITLCC0_CTRS_Pos        (0UL)    /*!< CTRS (Bit 0)                                          */
 #define R_TML_ITLCC0_CTRS_Msk        (0x3UL)  /*!< CTRS (Bitfield-Mask: 0x03)                            */
 #define R_TML_ITLCC0_CAPCCR_Pos      (3UL)    /*!< CAPCCR (Bit 3)                                        */
 #define R_TML_ITLCC0_CAPCCR_Msk      (0x8UL)  /*!< CAPCCR (Bitfield-Mask: 0x01)                          */
 #define R_TML_ITLCC0_CAPR_Pos        (4UL)    /*!< CAPR (Bit 4)                                          */
 #define R_TML_ITLCC0_CAPR_Msk        (0x10UL) /*!< CAPR (Bitfield-Mask: 0x01)                            */
 #define R_TML_ITLCC0_CAPF_Pos        (5UL)    /*!< CAPF (Bit 5)                                          */
 #define R_TML_ITLCC0_CAPF_Msk        (0x20UL) /*!< CAPF (Bitfield-Mask: 0x01)                            */
 #define R_TML_ITLCC0_CAPFCR_Pos      (6UL)    /*!< CAPFCR (Bit 6)                                        */
 #define R_TML_ITLCC0_CAPFCR_Msk      (0x40UL) /*!< CAPFCR (Bitfield-Mask: 0x01)                          */
 #define R_TML_ITLCC0_CAPEN_Pos       (7UL)    /*!< CAPEN (Bit 7)                                         */
 #define R_TML_ITLCC0_CAPEN_Msk       (0x80UL) /*!< CAPEN (Bitfield-Mask: 0x01)                           */
/* =========================================================  ITLS0  ========================================================= */
 #define R_TML_ITLS0_ITF00_Pos        (0UL)    /*!< ITF00 (Bit 0)                                         */
 #define R_TML_ITLS0_ITF00_Msk        (0x1UL)  /*!< ITF00 (Bitfield-Mask: 0x01)                           */
 #define R_TML_ITLS0_ITF01_Pos        (1UL)    /*!< ITF01 (Bit 1)                                         */
 #define R_TML_ITLS0_ITF01_Msk        (0x2UL)  /*!< ITF01 (Bitfield-Mask: 0x01)                           */
 #define R_TML_ITLS0_ITF02_Pos        (2UL)    /*!< ITF02 (Bit 2)                                         */
 #define R_TML_ITLS0_ITF02_Msk        (0x4UL)  /*!< ITF02 (Bitfield-Mask: 0x01)                           */
 #define R_TML_ITLS0_ITF03_Pos        (3UL)    /*!< ITF03 (Bit 3)                                         */
 #define R_TML_ITLS0_ITF03_Msk        (0x8UL)  /*!< ITF03 (Bitfield-Mask: 0x01)                           */
 #define R_TML_ITLS0_ITF0C_Pos        (4UL)    /*!< ITF0C (Bit 4)                                         */
 #define R_TML_ITLS0_ITF0C_Msk        (0x10UL) /*!< ITF0C (Bitfield-Mask: 0x01)                           */
/* ========================================================  ITLMKF0  ======================================================== */
 #define R_TML_ITLMKF0_MKF00_Pos      (0UL)    /*!< MKF00 (Bit 0)                                         */
 #define R_TML_ITLMKF0_MKF00_Msk      (0x1UL)  /*!< MKF00 (Bitfield-Mask: 0x01)                           */
 #define R_TML_ITLMKF0_MKF01_Pos      (1UL)    /*!< MKF01 (Bit 1)                                         */
 #define R_TML_ITLMKF0_MKF01_Msk      (0x2UL)  /*!< MKF01 (Bitfield-Mask: 0x01)                           */
 #define R_TML_ITLMKF0_MKF02_Pos      (2UL)    /*!< MKF02 (Bit 2)                                         */
 #define R_TML_ITLMKF0_MKF02_Msk      (0x4UL)  /*!< MKF02 (Bitfield-Mask: 0x01)                           */
 #define R_TML_ITLMKF0_MKF03_Pos      (3UL)    /*!< MKF03 (Bit 3)                                         */
 #define R_TML_ITLMKF0_MKF03_Msk      (0x8UL)  /*!< MKF03 (Bitfield-Mask: 0x01)                           */
 #define R_TML_ITLMKF0_MKF0C_Pos      (4UL)    /*!< MKF0C (Bit 4)                                         */
 #define R_TML_ITLMKF0_MKF0C_Msk      (0x10UL) /*!< MKF0C (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                          R_TRNG                                           ================ */
/* =========================================================================================================================== */

